#include "Receipt.h"
#include <iostream>
#include <string>

using namespace std;

void Receipt::omlete(){
    cout << "\t\t\t\tОМЛЕТ\n\n\nВам понадобятся следующие продукты:\n2 яйца;\n50 мл молока;\nщепотка соли;\nнемного ваших любимых специй и приправ;\n1 чайная ложка масла для жарки;\nукроп, петрушка, лук или другая зелень.\n\nДаже если вы очень любите специи, пряности или зелень, не стоит увлекаться ими при готовке омлета, иначе вы перебьёте его собственный вкус.\nПри помощи миксера или венчика взбейте яйца. Начинайте с маленькой скорости и постепенно увеличивайте до максимальной.\nЯйца для омлета взбейте миксером или венчиком\nДобавьте к яйцам молоко, соль и специ\nЖарьте омлет, накрыв сковороду крышкой" << endl << endl;
}

void Receipt::salad(){
    cout << "\t\t\t\tСАЛАТ\n\n\nВам понадобятся следующие продукты:\n1 огурец\n1 большой помидор\n1 болгарский перец\n15-20 маслин без косточки\n0,5 луковицы\n100 г сыра Фета\nпетрушка\nитальянские травы\nоливковое масло\n\nПомидоры, огурцы и перец порезать крупно, лук нарезать тонкими кольцами, фету - кубиками.\n\nСоединить овощи, маслины и зелень, посыпать фетой, итальянскими травами и заправить «Греческий» салат оливковым маслом." << endl << endl;
}

void Receipt::borsch(){
    cout << "\t\t\t\tБОРЩ\n\n\nВам понадобятся следующие продукты:\nМясо свиное - 450 г\nКартофель - 2-3 шт. (300 г)\nЛук репчатый - 1 шт. (120 г)\nСвекла - 1-2 шт. (200 г)\nМорковь - 1 шт. (120 г)\nКапуста - 200 г\nТоматная паста (по желанию) - 1-2 ст. л. или помидоры свежие (по желанию) - 2 шт.\nМасло растительное - 2 ст. л.\nЗелень (укроп, петрушка, зеленый лук) - по вкусу\nСок лимона (по желанию) - 1 ст. л.\nСметана - по вкусу\nЛавровый лист (по желанию) - 2 шт.\nЧеснок - 1-2 зубчика\nСоль, сахар, перец - по вкусу\n\nСначала сварить бульон: мясо положить в воду, добавить перец горошком и лавровый лист, слегка посолить. Варить 1,5-2 ч.Далее подготовить ингредиенты: нарезать лук полукольцами, капусту нарезать, морковь и свёклу натереть на крупной тёрке, картофель нарезать.\nНа сковороде обжарить лук, добавить морковь и потом уже свёклу. Дать немного поджариться. Для сохранения цвета добавить буквально 1 ст.л. уксуса.\nТакже добавить немного томатной пасты. Все это немного пассеровать и снять с огня.Из бульона вытащить мясо, добавить картофель. Когда он будет почти готов, добавить пассеровку из сковороды и капусту.Добавить соль, приправы, свежую зелень. Вернуть мясо и оставить минут на 15 на медленном огне.Дать борщу настояться.Приятного аппетита!" << endl << endl;
}

void Receipt::pancakes(){
    cout << "\t\t\t\tБЛИНЫ\n\n\nВам понадобятся следующие продукты:\nЯйцо куриное - 3 шт.\nМолоко (теплое) - 700 мл\nСахар - 1 ст.ложка\nСоль - 1 ч.ложка\nМука - 7 ст.ложек (с горкой)\nСода - 0,5 ч.ложки (погасить уксусом)\nРастительное масло - 2 ст.ложки\n\nВ миску разбить яйца, добавить теплое молоко, соль, сахар, растительное масло, соду, гашенную уксусом. Все хорошо взбить венчиком или вилкой.\nМуку просеять. Добавлять по одной столовой ложке.\nХорошо все взбивать, чтобы не было комков.\nРазогреть сковороду. Печь блины надо на сухой раскаленной сковороде, смазать ее только перед первым блином.\nПечь до золотистого цвета с одной стороны, а затем с другой.\nСкладывать блины в стопочку. Затем сразу накрыть чистым полотенцем. Дать им немного остыть." << endl << endl;
}

void Receipt::mousse(){
    cout << "\t\t\t\tМУСС\n\n\nВам понадобятся следующие продукты:\nШоколад черный (разломанный на кусочки) - 150 г\nСливки жирные - 200 г\nСахар - 75 г\nЯйца комнатной температуры - 2 шт.\nКакао порошок для сервировки\nШоколадная стружка для сервировки\nЦукаты апельсиновые для сервировки\n\n1. Шоколад сложить в миску, поместить на водяную баню, оставить на бане, помешивая, до расплавления шоколада. Снять миску с бани, оставить шоколад, чтобы он немного остыл.\n2. В чистой миске взбить сливки с 1 ст. ложкой сахара до устойчивого состояния. Отставить сливки в сторону.\n3. В другой чистой миске взбить белки с 4 ст. ложками сахара до пышной массы.\n4. В третьей миске взбить яичные желтки с оставшимся сахаром до однородного состояния. Ввести желтки в шоколадную массу.\n5. В шоколадную смесь ввести взбитые сливки и белки.\n6. Выложить шоколадный мусс в сервировочные порционные формочки. Для застывания поместить шоколадный мусс в холодильник на 1 час.\n7. Перед подачей достать мусс из холодильника. Посыпать шоколадный мусс какао порошком, шоколадной стружкой или цукатами." << endl << endl;
}

void Receipt::oysters(){
    cout << "\t\t\t\tУСТРИЦЫ\n\n\nВам понадобятся следующие продукты:\nУстрицы открытые – 24 шт.\nЛук шалот (рубленый) – 2 шт.\nЛистья шпината свежие (рубленые) – 500 г\nПетрушка свежая (рубленая) – 60 г\nЛистья сельдерея (рубленые) – 60 г\nХлебные крошки цельнозернового хлеба – 90 г\nСоль морская крупная – 450 г (3 стакана)\nМасло сливочное – 120 г\nВодка – 10-20 г\nПерец кайенский\nСоль морская\nПерец черный молотый\nДольки лайма или лимона для сервировки\n\n1. Включить духовку для предварительного разогрева до 220 градусов. На большой противень высыпать 450 грамм морской крупной соли. Половинки устриц выложить на соль, чтобы раковины устойчиво стояли на ней.\n2. В большой сковороде разогреть сливочное масло, высыпать шалот, готовить, помешивая, около 2-3 минут, до мягкого состояния. Ввести шпинат, готовить до увядания листьев.\n3. Высыпать в сковороду петрушку, сельдерей и хлебные крошки, готовить, помешивая, около 5 минут. Посолить и поперчить начинку по вкусу.\n4. Выложить начинку на устрицы, полить каждую устрицу несколькими каплями водки. Поместить противень в разогретую духовку на 5 минут.\n5. Подавать устрицы на тарелках, засыпанных морской солью. Хорошо подать к устрицам дольки лайма." << endl << endl;
}

void Receipt::list_breakfast(){
    cout << "\t\t\t\t СПИСОК ИДЕЙ\n\n\nяичница или омлет\nовсяная каша с добавлением фруктов или сухофруктов\nмюсли, заправленные соком или молоком\nгречневая каша с молоком\nфруктовый салат\nовощной салат с зеленью\nтворог с фруктами\nцельнозерновой хлеб" << endl << endl;
}

void Receipt::list_lunch(){
    cout << "\t\t\t\t СПИСОК ИДЕЙ\n\n\nтыквенный суп\nсырный суп\nкуриный бульон\nборщ\nкартофель с курицей\nгречка с котлетами\nмакароны по-флотски\nрис с рыбой" << endl << endl;
}

void Receipt::list_dinner(){
    cout << "\t\t\t\t СПИСОК ИДЕЙ\n\n\nговядина с овощами\nмитболы с салатом из базилика\nгречка с мясом\nлазанья\nтефтели с пюре\nдраники со сметаной\nманты\nкартофель с грибами" << endl << endl;
}

void Simple::omlete(){
    Receipt::omlete();
}

void Simple::salad(){
    Receipt::salad();
}

void Middle::borsch(){
    Receipt::borsch();
}

void Middle::pancakes(){
    Receipt::pancakes();
}

